{
  "tools": {
    "http-status-codes": {
      "categories": {
        "1xx-informational-response": "Resposta informativa 1xx",
        "2xx-success": "Sucesso 2xx",
        "3xx-redirection": "Redirecionamento 3xx",
        "4xx-client-error": "Erro do cliente 4xx",
        "5xx-server-error": "Erro do servidor 5xx"
      },
      "codes": {
        "100": {
          "description": "Aguardando o cliente enviar o corpo da solicitação.",
          "name": "Continuar"
        },
        "101": {
          "description": "O servidor concordou em mudar o protocolo.",
          "name": "Mudando protocolo"
        },
        "102": {
          "description": "O servidor está processando a solicitação, mas nenhuma resposta está disponível ainda.",
          "name": "Processando"
        },
        "103": {
          "description": "O servidor retorna alguns cabeçalhos de resposta antes da mensagem HTTP final.",
          "name": "Dicas iniciais"
        },
        "200": {
          "description": "Resposta padrão para solicitações HTTP bem-sucedidas.",
          "name": "OK"
        },
        "201": {
          "description": "A solicitação foi atendida, resultando na criação de um novo recurso.",
          "name": "Criado"
        },
        "202": {
          "description": "A solicitação foi aceita para processamento, mas o processamento não foi concluído.",
          "name": "Aceito"
        },
        "203": {
          "description": "A solicitação é bem-sucedida, mas o conteúdo da solicitação original foi modificado por um proxy transformador.",
          "name": "Informação não autoritativa"
        },
        "204": {
          "description": "O servidor processou a solicitação com sucesso e não está retornando nenhum conteúdo.",
          "name": "Sem conteúdo"
        },
        "205": {
          "description": "O servidor indica reinicializar a visualização do documento que enviou esta solicitação.",
          "name": "Redefinir conteúdo"
        },
        "206": {
          "description": "O servidor está entregando apenas parte do recurso devido a um cabeçalho de intervalo enviado pelo cliente.",
          "name": "Conteúdo parcial"
        },
        "207": {
          "description": "O corpo da mensagem que segue é uma mensagem XML e pode conter vários códigos de resposta separados.",
          "name": "Multi-status"
        },
        "208": {
          "description": "Os membros de uma ligação DAV já foram enumerados em uma parte anterior da resposta (multistatus).",
          "name": "Já relatado"
        },
        "226": {
          "description": "O servidor atendeu a uma solicitação para o recurso, e a resposta é uma representação do resultado.",
          "name": "IM usado"
        },
        "300": {
          "description": "Indica múltiplas opções para o recurso que o cliente pode seguir.",
          "name": "Múltiplas escolhas"
        },
        "301": {
          "description": "Esta e todas as solicitações futuras devem ser direcionadas para o URI fornecido.",
          "name": "Movido permanentemente"
        },
        "302": {
          "description": "Redirecionar para outra URL. Este é um exemplo de prática da indústria que contradiz o padrão.",
          "name": "Encontrado"
        },
        "303": {
          "description": "A resposta à solicitação pode ser encontrada sob outro URI usando um método GET.",
          "name": "Ver outro"
        },
        "304": {
          "description": "Indica que o recurso não foi modificado desde a versão especificada pelos cabeçalhos de solicitação.",
          "name": "Não modificado"
        },
        "305": {
          "description": "O recurso solicitado está disponível apenas através de um proxy, cujo endereço é fornecido na resposta.",
          "name": "Usar proxy"
        },
        "306": {
          "description": "Não é mais usado. Originalmente significava \"Solicitações subsequentes devem usar o proxy especificado.\"",
          "name": "Trocar proxy"
        },
        "307": {
          "description": "Neste caso, a solicitação deve ser repetida com outro URI; no entanto, solicitações futuras ainda devem usar o URI original.",
          "name": "Redirecionamento temporário"
        },
        "308": {
          "description": "A solicitação e todas as solicitações futuras devem ser repetidas usando outro URI.",
          "name": "Redirecionamento permanente"
        },
        "400": {
          "description": "O servidor não pode ou não processará a solicitação devido a um erro aparente do cliente.",
          "name": "Solicitação inválida"
        },
        "401": {
          "description": "Similar a 403 Proibido, mas especificamente para uso quando a autenticação é necessária e falhou ou ainda não foi fornecida.",
          "name": "Não autorizado"
        },
        "402": {
          "description": "Reservado para uso futuro. A intenção original era que este código pudesse ser usado como parte de alguma forma de dinheiro digital ou esquema de micropagamento.",
          "name": "Pagamento necessário"
        },
        "403": {
          "description": "A solicitação era válida, mas o servidor está recusando a ação. O usuário pode não ter as permissões necessárias para um recurso.",
          "name": "Proibido"
        },
        "404": {
          "description": "O recurso solicitado não pôde ser encontrado, mas pode estar disponível no futuro.",
          "name": "Não encontrado"
        },
        "405": {
          "description": "Um método de solicitação não é suportado para o recurso solicitado.",
          "name": "Método não permitido"
        },
        "406": {
          "description": "O recurso solicitado é capaz de gerar apenas conteúdo não aceitável de acordo com os cabeçalhos Accept enviados na solicitação.",
          "name": "Não aceitável"
        },
        "407": {
          "description": "O cliente deve primeiro se autenticar com o proxy.",
          "name": "Autenticação de proxy necessária"
        },
        "408": {
          "description": "O servidor expirou aguardando a solicitação.",
          "name": "Tempo de espera da solicitação"
        },
        "409": {
          "description": "Indica que a solicitação não pôde ser processada devido a um conflito na solicitação, como um conflito de edição.",
          "name": "Conflito"
        },
        "410": {
          "description": "Indica que o recurso solicitado não está mais disponível e não estará disponível novamente.",
          "name": "Desaparecido"
        },
        "411": {
          "description": "A solicitação não especificou o comprimento de seu conteúdo, que é necessário pelo recurso solicitado.",
          "name": "Comprimento necessário"
        },
        "412": {
          "description": "O servidor não atende a uma das pré-condições que o solicitante colocou na solicitação.",
          "name": "Pré-condição falhou"
        },
        "413": {
          "description": "A solicitação é maior do que o servidor está disposto ou é capaz de processar.",
          "name": "Carga útil muito grande"
        },
        "414": {
          "description": "O URI fornecido era muito longo para o servidor processar.",
          "name": "URI muito longo"
        },
        "415": {
          "description": "A entidade de solicitação tem um tipo de mídia que o servidor ou recurso não suporta.",
          "name": "Tipo de mídia não suportado"
        },
        "416": {
          "description": "O cliente pediu uma parte do arquivo, mas o servidor não pode fornecer essa parte.",
          "name": "Intervalo não satisfatório"
        },
        "417": {
          "description": "O servidor não pode atender aos requisitos do campo de cabeçalho de solicitação Expect.",
          "name": "Expectativa falhou"
        },
        "418": {
          "description": "O servidor recusa a tentativa de preparar café com um bule.",
          "name": "Sou um bule"
        },
        "421": {
          "description": "A solicitação foi direcionada a um servidor que não é capaz de produzir uma resposta.",
          "name": "Solicitação mal direcionada"
        },
        "422": {
          "description": "A solicitação estava bem formada, mas não pôde ser seguida devido a erros semânticos.",
          "name": "Entidade não processável"
        },
        "423": {
          "description": "O recurso que está sendo acessado está bloqueado.",
          "name": "Bloqueado"
        },
        "424": {
          "description": "A solicitação falhou devido à falha de uma solicitação anterior.",
          "name": "Dependência falhou"
        },
        "425": {
          "description": "Indica que o servidor não está disposto a arriscar processar uma solicitação que pode ser reproduzida.",
          "name": "Muito cedo"
        },
        "426": {
          "description": "O cliente deve mudar para um protocolo diferente, como TLS/1.0.",
          "name": "Atualização necessária"
        },
        "428": {
          "description": "O servidor de origem requer que a solicitação seja condicional.",
          "name": "Pré-condição necessária"
        },
        "429": {
          "description": "O usuário enviou muitas solicitações em um determinado período de tempo.",
          "name": "Muitas solicitações"
        },
        "431": {
          "description": "O servidor não está disposto a processar a solicitação porque um campo de cabeçalho individual ou todos os campos de cabeçalho coletivamente são muito grandes.",
          "name": "Campos de cabeçalho de solicitação muito grandes"
        },
        "451": {
          "description": "Um operador do servidor recebeu uma demanda legal para negar acesso a um recurso ou a um conjunto de recursos que inclui o recurso solicitado.",
          "name": "Indisponível por razões legais"
        },
        "500": {
          "description": "Uma mensagem de erro genérica, fornecida quando uma condição inesperada foi encontrada e nenhuma mensagem mais específica é adequada.",
          "name": "Erro interno do servidor"
        },
        "501": {
          "description": "O servidor não reconhece o método de solicitação ou não tem a capacidade de atender à solicitação.",
          "name": "Não implementado"
        },
        "502": {
          "description": "O servidor estava atuando como um gateway ou proxy e recebeu uma resposta inválida do servidor upstream.",
          "name": "Gateway inválido"
        },
        "503": {
          "description": "O servidor está atualmente indisponível (porque está sobrecarregado ou fora de serviço para manutenção).",
          "name": "Serviço indisponível"
        },
        "504": {
          "description": "O servidor estava atuando como um gateway ou proxy e não recebeu uma resposta oportuna do servidor upstream.",
          "name": "Tempo de espera do gateway"
        },
        "505": {
          "description": "O servidor não suporta a versão do protocolo HTTP usada na solicitação.",
          "name": "Versão HTTP não suportada"
        },
        "506": {
          "description": "A negociação transparente de conteúdo para a solicitação resulta em uma referência circular.",
          "name": "Variante também negocia"
        },
        "507": {
          "description": "O servidor é incapaz de armazenar a representação necessária para concluir a solicitação.",
          "name": "Armazenamento insuficiente"
        },
        "508": {
          "description": "O servidor detectou um loop infinito ao processar a solicitação.",
          "name": "Loop detectado"
        },
        "510": {
          "description": "Extensões adicionais à solicitação são necessárias para que o servidor a atenda.",
          "name": "Não estendido"
        },
        "511": {
          "description": "O cliente precisa se autenticar para obter acesso à rede.",
          "name": "Autenticação de rede necessária"
        }
      },
      "forType": "Para {type}.",
      "searchPlaceholder": "Pesquisar status HTTP...",
      "searchResults": "Resultados da pesquisa",
      "types": {
        "http": "HTTP",
        "webdav": "WebDav"
      }
    }
  }
}