{
  "tools": {
    "http-status-codes": {
      "searchPlaceholder": "Поиск HTTP статуса...",
      "searchResults": "Результаты поиска",
      "forType": "Для {type}.",
      "types": {
        "http": "HTTP",
        "webdav": "WebDav"
      },
      "categories": {
        "1xx-informational-response": "Информационный ответ 1xx",
        "2xx-success": "Успех 2xx",
        "3xx-redirection": "Перенаправление 3xx",
        "4xx-client-error": "Ошибка клиента 4xx",
        "5xx-server-error": "Ошибка сервера 5xx"
      },
      "codes": {
        "100": {
          "name": "Продолжить",
          "description": "Ожидание отправки клиентом тела запроса."
        },
        "101": {
          "name": "Переключение протоколов",
          "description": "Сервер согласился изменить протокол."
        },
        "102": {
          "name": "Обработка",
          "description": "Сервер обрабатывает запрос, но ответ еще недоступен."
        },
        "103": {
          "name": "Ранние подсказки",
          "description": "Сервер возвращает некоторые заголовки ответа перед финальным HTTP-сообщением."
        },
        "200": {
          "name": "OK",
          "description": "Стандартный ответ для успешных HTTP-запросов."
        },
        "201": {
          "name": "Создано",
          "description": "Запрос был выполнен, что привело к созданию нового ресурса."
        },
        "202": {
          "name": "Принято",
          "description": "Запрос был принят для обработки, но обработка не завершена."
        },
        "203": {
          "name": "Неавторитетная информация",
          "description": "Запрос успешен, но содержимое исходного запроса было изменено преобразующим прокси."
        },
        "204": {
          "name": "Нет содержимого",
          "description": "Сервер успешно обработал запрос и не возвращает никакого содержимого."
        },
        "205": {
          "name": "Сбросить содержимое",
          "description": "Сервер указывает переинициализировать представление документа, который отправил этот запрос."
        },
        "206": {
          "name": "Частичное содержимое",
          "description": "Сервер доставляет только часть ресурса из-за заголовка диапазона, отправленного клиентом."
        },
        "207": {
          "name": "Множественный статус",
          "description": "Тело сообщения, которое следует, является XML-сообщением и может содержать несколько отдельных кодов ответа."
        },
        "208": {
          "name": "Уже сообщено",
          "description": "Члены привязки DAV уже были перечислены в предыдущей части ответа (multistatus)."
        },
        "226": {
          "name": "IM используется",
          "description": "Сервер выполнил запрос на ресурс, и ответ является представлением результата."
        },
        "300": {
          "name": "Множественный выбор",
          "description": "Указывает несколько вариантов для ресурса, которые клиент может выбрать."
        },
        "301": {
          "name": "Перемещено навсегда",
          "description": "Этот и все будущие запросы должны быть направлены на указанный URI."
        },
        "302": {
          "name": "Найдено",
          "description": "Перенаправление на другой URL. Это пример практики отрасли, противоречащей стандарту."
        },
        "303": {
          "name": "См. другое",
          "description": "Ответ на запрос можно найти по другому URI, используя метод GET."
        },
        "304": {
          "name": "Не изменено",
          "description": "Указывает, что ресурс не был изменен с версии, указанной заголовками запроса."
        },
        "305": {
          "name": "Использовать прокси",
          "description": "Запрошенный ресурс доступен только через прокси, адрес которого указан в ответе."
        },
        "306": {
          "name": "Переключить прокси",
          "description": "Больше не используется. Первоначально означало \"Последующие запросы должны использовать указанный прокси.\""
        },
        "307": {
          "name": "Временное перенаправление",
          "description": "В этом случае запрос должен быть повторен с другим URI; однако будущие запросы все еще должны использовать исходный URI."
        },
        "308": {
          "name": "Постоянное перенаправление",
          "description": "Запрос и все будущие запросы должны быть повторены с использованием другого URI."
        },
        "400": {
          "name": "Плохой запрос",
          "description": "Сервер не может или не будет обрабатывать запрос из-за очевидной ошибки клиента."
        },
        "401": {
          "name": "Неавторизован",
          "description": "Аналогично 403 Запрещено, но специально для использования, когда требуется аутентификация и она не удалась или еще не предоставлена."
        },
        "402": {
          "name": "Требуется оплата",
          "description": "Зарезервировано для будущего использования. Первоначальное намерение заключалось в том, что этот код может использоваться как часть какой-либо формы цифровых денег или схемы микроплатежей."
        },
        "403": {
          "name": "Запрещено",
          "description": "Запрос был действительным, но сервер отказывается выполнять действие. У пользователя может не быть необходимых разрешений для ресурса."
        },
        "404": {
          "name": "Не найдено",
          "description": "Запрошенный ресурс не может быть найден, но может быть доступен в будущем."
        },
        "405": {
          "name": "Метод не разрешен",
          "description": "Метод запроса не поддерживается для запрошенного ресурса."
        },
        "406": {
          "name": "Неприемлемо",
          "description": "Запрошенный ресурс способен генерировать только содержимое, неприемлемое согласно заголовкам Accept, отправленным в запросе."
        },
        "407": {
          "name": "Требуется аутентификация прокси",
          "description": "Клиент должен сначала аутентифицироваться у прокси."
        },
        "408": {
          "name": "Тайм-аут запроса",
          "description": "Сервер истек время ожидания запроса."
        },
        "409": {
          "name": "Конфликт",
          "description": "Указывает, что запрос не может быть обработан из-за конфликта в запросе, такого как конфликт редактирования."
        },
        "410": {
          "name": "Удалено",
          "description": "Указывает, что запрошенный ресурс больше недоступен и не будет доступен снова."
        },
        "411": {
          "name": "Требуется длина",
          "description": "Запрос не указал длину своего содержимого, что требуется запрошенным ресурсом."
        },
        "412": {
          "name": "Предусловие не выполнено",
          "description": "Сервер не соответствует одному из предусловий, которые запрашивающая сторона установила для запроса."
        },
        "413": {
          "name": "Полезная нагрузка слишком велика",
          "description": "Запрос больше, чем сервер готов или способен обработать."
        },
        "414": {
          "name": "URI слишком длинный",
          "description": "Предоставленный URI был слишком длинным для обработки сервером."
        },
        "415": {
          "name": "Неподдерживаемый тип медиа",
          "description": "Сущность запроса имеет тип медиа, который сервер или ресурс не поддерживает."
        },
        "416": {
          "name": "Диапазон не выполним",
          "description": "Клиент запросил часть файла, но сервер не может предоставить эту часть."
        },
        "417": {
          "name": "Ожидание не выполнено",
          "description": "Сервер не может соответствовать требованиям поля заголовка запроса Expect."
        },
        "418": {
          "name": "Я чайник",
          "description": "Сервер отказывается от попытки заварить кофе чайником."
        },
        "421": {
          "name": "Неправильно направленный запрос",
          "description": "Запрос был направлен на сервер, который не может дать ответ."
        },
        "422": {
          "name": "Необрабатываемая сущность",
          "description": "Запрос был правильно сформирован, но не может быть выполнен из-за семантических ошибок."
        },
        "423": {
          "name": "Заблокировано",
          "description": "Ресурс, к которому осуществляется доступ, заблокирован."
        },
        "424": {
          "name": "Неудачная зависимость",
          "description": "Запрос не удался из-за неудачи предыдущего запроса."
        },
        "425": {
          "name": "Слишком рано",
          "description": "Указывает, что сервер не желает рисковать обработкой запроса, который может быть воспроизведен."
        },
        "426": {
          "name": "Требуется обновление",
          "description": "Клиент должен переключиться на другой протокол, такой как TLS/1.0."
        },
        "428": {
          "name": "Требуется предусловие",
          "description": "Сервер-источник требует, чтобы запрос был условным."
        },
        "429": {
          "name": "Слишком много запросов",
          "description": "Пользователь отправил слишком много запросов за определенный период времени."
        },
        "431": {
          "name": "Поля заголовка запроса слишком большие",
          "description": "Сервер не желает обрабатывать запрос, потому что либо отдельное поле заголовка, либо все поля заголовка вместе слишком большие."
        },
        "451": {
          "name": "Недоступно по юридическим причинам",
          "description": "Оператор сервера получил юридическое требование об отказе в доступе к ресурсу или набору ресурсов, который включает запрошенный ресурс."
        },
        "500": {
          "name": "Внутренняя ошибка сервера",
          "description": "Общее сообщение об ошибке, выдаваемое при обнаружении неожиданного условия и отсутствии более конкретного сообщения."
        },
        "501": {
          "name": "Не реализовано",
          "description": "Сервер либо не распознает метод запроса, либо не имеет возможности выполнить запрос."
        },
        "502": {
          "name": "Плохой шлюз",
          "description": "Сервер действовал как шлюз или прокси и получил недопустимый ответ от вышестоящего сервера."
        },
        "503": {
          "name": "Служба недоступна",
          "description": "Сервер в настоящее время недоступен (потому что он перегружен или отключен для обслуживания)."
        },
        "504": {
          "name": "Тайм-аут шлюза",
          "description": "Сервер действовал как шлюз или прокси и не получил своевременный ответ от вышестоящего сервера."
        },
        "505": {
          "name": "Версия HTTP не поддерживается",
          "description": "Сервер не поддерживает версию протокола HTTP, используемую в запросе."
        },
        "506": {
          "name": "Вариант также ведет переговоры",
          "description": "Прозрачное согласование содержимого для запроса приводит к циклической ссылке."
        },
        "507": {
          "name": "Недостаточно места",
          "description": "Сервер не может сохранить представление, необходимое для завершения запроса."
        },
        "508": {
          "name": "Обнаружен цикл",
          "description": "Сервер обнаружил бесконечный цикл при обработке запроса."
        },
        "510": {
          "name": "Не расширено",
          "description": "Для выполнения запроса сервером требуются дополнительные расширения запроса."
        },
        "511": {
          "name": "Требуется аутентификация сети",
          "description": "Клиенту необходимо пройти аутентификацию для получения доступа к сети."
        }
      }
    }
  }
}
